# LeaderArrowhead Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LeaderArrowhead Property
ParameterTypeId Class See Also
---
"Leader Arrowhead"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LeaderArrowhead { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LeaderArrowhead As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LeaderArrowhead {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace